const QuestionData = [
  {
    question:
      '1. ผู้บริหารระดับสูงชื่นชมผลงานที่คุณกำลังเสนออยู่ แต่จริง ๆ แล้ว ผลงานชิ้นนั้นเป็นของเพื่อนร่วมงาน ซึ่งคุณเป็นตัวแทน มานำเสนอเท่านั้น คุณจะเลือกวิธีในการตอบกลับผู้บริหารระดับสูงท่านนั้นอย่างไร  ',
    choices: [
      'ยิ้มตอบรับและไม่พูดอะไร',
      'บอกไปตามตรงว่าเป็นผลงานเพื่อนร่วมงาน ไม่ใช่ของตน',
      'บอกไปว่ามีเพื่อนอีกคนสร้างผลงานร่วมกัน',
      'ไม่ตอบรับอะไรกลับไปเลย',
      'กล่าวขอบคุณและอ้างว่าผลงานนั้นเป็นของตน',
    ],
    type: 1,
    lastPosition: 0,
  },
  {
    question:
      '2. xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx',
    choices: ['xxx', 'xxx', 'xxx', 'xxx', 'xxx'],
    type: 1,
    lastPosition: 1,
  },
  {
    question:
      '1.คุณและเพื่อนเป็นพนักงานในบริษัทแห่งหนึ่งที่มีความสนิทสนมกันมาก และทำผลงานได้ดีอย่างต่อเนื่องมาโดยตลอด อีกทั้งยังเป็นตัวหลักในการสร้างกำไรให้กับองค์กรอย่างมาก วันหนึ่งคุณพบว่าเพื่อนของคุณทุจริตต่อบริษัท  แต่เป็นการทุจริตที่ไม่ส่งผลกระทบต่อองค์กรมากนัก คุณคิดว่าสิ่งใดที่คุณไม่ควรทำ (สามารถตอบได้มากกว่า 1 ข้อ)',
    choices: [
      'ไปรายงานกับหัวหน้าทันทีที่ทราบ เพราะมันเป็นสิ่งที่ผิด',
      'ให้เพื่อนทุจริตต่อไป เพราะกลัวว่า เพื่อนโดนไล่ออก แล้วจะส่งผลต่อผลกำไรของบริษัทและพนักงานทุกคนในบริษัท',
      'ตักเตือนเพื่อน โดยบอกเพื่อนตรง ๆ และให้สัญญาว่าจะไม่ทำอีก แล้วตนจะไม่บอกให้หัวหน้ารับทราบเป็นการต่อรอง',
      'ตักเตือนเพื่อน และนำเรื่องนี้ไปบอกหัวหน้า พร้อมหลักฐานทั้งหมด',
      'ตักเตือนเพื่อน และช่วยเพื่อนปกปิดและทำลายหลักฐานทั้งหมด',
    ],
    type: 2,
    lastPosition: 0,
  },
  {
    question: 'What is 2 + 2?',
    choices: ['1', '2', '3', '4', '5'],
    type: '2',
    lastPosition: 1,
  },
];

export default QuestionData;
