const QuestionData = [
  {
    question:
      '1. ผู้บริหารระดับสูงชื่นชมผลงานที่คุณกำลังเสนออยู่ แต่จริง ๆ แล้ว ผลงานชิ้นนั้นเป็นของเพื่อนร่วมงาน ซึ่งคุณเป็นตัวแทน มานำเสนอเท่านั้น คุณจะเลือกวิธีในการตอบกลับผู้บริหารระดับสูงท่านนั้นอย่างไร  ',
    choices: [
      'ยิ้มตอบรับและไม่พูดอะไร',
      'บอกไปตามตรงว่าเป็นผลงานเพื่อนร่วมงาน ไม่ใช่ของตน',
      'Green',
      'บอกไปว่ามีเพื่อนอีกคนสร้างผลงานร่วมกัน',
      'ไม่ตอบรับอะไรกลับไปเลย',
      'กล่าวขอบคุณและอ้างว่าผลงานนั้นเป็นของตน',
    ],
    answer: 'Blue',
  },
  {
    question: 'What is the capital of France?',
    choices: ['Madrid', 'Berlin', 'Paris', 'Rome', 'Vienna'],
    answer: 'Paris',
  },
  {
    question: 'What is 2 + 2?',
    choices: ['1', '2', '3', '4', '5'],
    answer: '4',
  },
];

export default QuestionData;
