const QuestionData = [
  {
    question:
      '1. ผู้บริหารระดับสูงชื่นชมผลงานที่คุณกำลังเสนออยู่ แต่จริง ๆ แล้ว ผลงานชิ้นนั้นเป็นของเพื่อนร่วมงาน ซึ่งคุณเป็นตัวแทน มานำเสนอเท่านั้น คุณจะเลือกวิธีในการตอบกลับผู้บริหารระดับสูงท่านนั้นอย่างไร  ',
    choices: [
      'ยิ้มตอบรับและไม่พูดอะไร',
      'บอกไปตามตรงว่าเป็นผลงานเพื่อนร่วมงาน ไม่ใช่ของตน',
      'บอกไปว่ามีเพื่อนอีกคนสร้างผลงานร่วมกัน',
      'ไม่ตอบรับอะไรกลับไปเลย',
      'กล่าวขอบคุณและอ้างว่าผลงานนั้นเป็นของตน',
    ],
    type: 1,
    lastPosition: 0,
  },
  {
    question: '2. คำถาม',
    choices: [
      'คำตอบที่ 1',
      'คำตอบที่ 2',
      'คำตอบที่ 3',
      'คำตอบที่ 4',
      'คำตอบที่ 5',
    ],
    type: 1,
    lastPosition: 1,
  },
  {
    question:
      '1.คุณและเพื่อนเป็นพนักงานในบริษัทแห่งหนึ่งที่มีความสนิทสนมกันมาก และทำผลงานได้ดีอย่างต่อเนื่องมาโดยตลอด อีกทั้งยังเป็นตัวหลักในการสร้างกำไรให้กับองค์กรอย่างมาก วันหนึ่งคุณพบว่าเพื่อนของคุณทุจริตต่อบริษัท  แต่เป็นการทุจริตที่ไม่ส่งผลกระทบต่อองค์กรมากนัก คุณคิดว่าสิ่งใดที่คุณไม่ควรทำ (สามารถตอบได้มากกว่า 1 ข้อ)',
    choices: [
      'ไปรายงานกับหัวหน้าทันทีที่ทราบ เพราะมันเป็นสิ่งที่ผิด',
      'ให้เพื่อนทุจริตต่อไป เพราะกลัวว่า เพื่อนโดนไล่ออก แล้วจะส่งผลต่อผลกำไรของบริษัทและพนักงานทุกคนในบริษัท',
      'ตักเตือนเพื่อน โดยบอกเพื่อนตรง ๆ และให้สัญญาว่าจะไม่ทำอีก แล้วตนจะไม่บอกให้หัวหน้ารับทราบเป็นการต่อรอง',
      'ตักเตือนเพื่อน และนำเรื่องนี้ไปบอกหัวหน้า พร้อมหลักฐานทั้งหมด',
      'ตักเตือนเพื่อน และช่วยเพื่อนปกปิดและทำลายหลักฐานทั้งหมด',
    ],
    type: 2,
    lastPosition: 0,
  },
  {
    question: '2.คำถาม',
    choices: ['1', '2', '3', '4', '5'],
    type: 2,
    lastPosition: 0,
  },
  {
    question: '3.คำถาม',
    choices: ['1', '2', '3', '4', '5'],
    type: 2,
    lastPosition: 1,
  },
  {
    question:
      '1. คุณกำลังจะเซ็นสัญญาปิดการขายกับบริษัทลูกค้าซึ่งมีมูลค่าโครงการถึง 50 ล้านบาท โดยที่ ณ ขณะนั้น หัวหน้าที่คุณเคารพและมีความสนิทสนมอย่างสูงก็ถูกกดดันให้เพิ่มยอดขายให้ได้ หัวหน้าเรียกคุณให้ไปพบและบอกว่า อาชีพของหัวหน้ากำลังอยู่ในความเสี่ยง และอยากจะขอให้คุณรวม 50 ล้านบาท เข้าไปในการสรุปยอดขายประจำไตรมาส ซึ่งจะสิ้นสุดลงวันพรุ่งนี้ เพื่อนำเสนอต่อผู้บริหาร คุณรู้ว่าสัญญาขายกับบริษัทนี้มีความแน่นอนในระดับหนึ่ง แต่ช่วงนี้ลูกค้ายังอยู่ต่างจังหวัดและไม่สามารถเซ็นสัญญาได้ทันภายในวันพรุ่งนี้อย่างแน่นอน คุณจะทำอย่างไร',
    choices: [
      'บอกหัวหน้าอย่างตรงไปตรงมาว่าไม่สามารถทำตามที่ร้องขอได้ และให้เป็นความรับผิดชอบของหัวหน้า เราขอไม่มีส่วนเกี่ยวข้อง',
      'ยอมทำตามที่หัวหน้าร้องขอ เพื่อช่วยเหลืออนาคตในหน้าที่การงานของหัวหน้า เพราะคาดว่าข้อตกลงนี้ปิดการขายเรียบร้อยแล้ว',
    ],
    type: 3,
    lastPosition: 0,
  },
  {
    question: '2.คำถาม',
    choices: ['1', '2'],
    type: 3,
    lastPosition: 0,
  },
  {
    question: '3.คำถาม',
    choices: ['1', '2'],
    type: 3,
    lastPosition: 0,
  },
  {
    question: '4.คำถาม',
    choices: ['1', '2'],
    type: 3,
    lastPosition: 1,
  },
  {
    question:
      '1.  คุณให้ความสำคัญกับสิ่งใดมากกว่ากันระหว่างการมุ่งมั่นไปสู่เป้าหมายและความสำเร็จและการเห็นอกเห็นใจผู้อื่น',
    type: 4,
    lastPosition: 0,
  },
  {
    question:
      '2. คุณให้ความสำคัญกับสิ่งใดมากกว่ากันระหว่างการทำตามมาตรฐาน และ การใส่ใจความรู้สึกผู้อื่น',
    choices: ['5', '4', '3', '2', '1'],
    type: 4,
    lastPosition: 1,
  },
  {
    question:
      '2. คุณให้ความสำคัญกับสิ่งใดมากกว่ากันระหว่างการทำตามมาตรฐาน และ การใส่ใจความรู้สึกผู้อื่น',
    choices: ['5', '4', '3', '2', '1'],
    type: 4,
    lastPosition: 1,
  },
];

export default QuestionData;
