import React from 'react';
import './Introduction.css';

function SpeedTest() {
  return (
    <div id="speedtest1">
      <p>คำอธิบาย (1.1) </p>
      <ul>
        <li>คุณมีเวลาทั้งหมด 10 วินาที ในการตอบคำถามแต่ละข้อ</li>
        <li>
          เมื่อกดปุ่ม ข้อถัดไป เพื่อไปยังข้อถัดไป หรือ เมื่อเวลาหมด
          จะไม่สามารถย้อนกลับไปที่คำถามก่อนหน้าได้
        </li>
        <li>เลือกคำตอบที่ถูกต้องเพียง 1 ตัวเลือกเท่านั้น </li>
        <li>
          เมื่อทำข้อสอบเสร็จแล้วกดปุ่ม ส่งคำตอบ เพื่อไปสู่ข้อคำถามพาร์ทถัดไป
        </li>
      </ul>
    </div>
  );
}

export default SpeedTest;
