import React from 'react';
import './Introduction.css';

function Introduction() {
  return (
    <div class="box" id="introduction">
      <p>แบบประเมินชุดนี้ประกอบไปด้วยข้อคำถามทั้งหมด 2 พาร์ทหลัก ได้แก่ </p>
      <ul style={{ listStyleType: 'none' }}>
        <li>
          ข้อคำถาม Moral Temptation ซึ่งจะถูกแบ่งออกเป็น 2 พาร์ท
          <ul style={{ listStyleType: 'none' }}>
            <li>
              1.1 ข้อคำถาม Speed Test ซึ่งจะมีเวลาทั้งหมด 10 วินาที
              ในการตอบคำถามแต่ละข้อ เลือกคำตอบที่ถูกต้องเพียง 1 ตัวเลือกเท่านั้น
            </li>
            <li>
              1.2 ข้อคำถาม Odd man out ซึ่งจะมีเวลา 1 ชั่วโมง
              ในการตอบคำถามทุกข้อ สามารถเลือกคำตอบที่ไม่ถูกต้องได้หลายคำตอบ
            </li>
          </ul>
        </li>
        <li>
          ข้อคำถาม Ethical Direction ซึ่งจะถูกแบ่งออกเป็น 2 พาร์ท
          <ul style={{ listStyleType: 'none' }}>
            <li>
              2.1 ข้อคำถาม No time limit ซึ่งจะมีเวลา 1 ชั่วโมง
              ในการตอบคำถามทุกข้อ เลือกสถานการณ์ที่เหมาะสมที่สุดในความคิดของคุณ
              1 คำตอบเท่านั้น{' '}
            </li>
            <li>
              2.2 ข้อคำถาม Speed Test ซึ่งจะมีเวลาทั้งหมด 10 วินาที
              ในการตอบคำถามแต่ละข้อ เลือกคำตอบที่ถูกต้องเพียง 1 ตัวเลือกเท่านั้น
            </li>
          </ul>
        </li>
      </ul>
      <p>ข้อคำถามทั้งหมดจะใช้ระยะเวลาในการทำทั้งสิ้นประมาณ 2 ชั่วโมง</p>
      <p>
        ซึ่งคำอธิบายทั้งหมดจะปรากฎขึ้นอีกครั้งเมื่อคุณมาถึงข้อคำถามในแต่ละพาร์ท
      </p>
    </div>
  );
}

export default Introduction;
